app/controllers/school_classes_controller.rb

  def create
    @student_class = SchoolClass.new(post_params(:title, :room_number))
    @student_class.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]